Если ТипЗнч(Источник) = Тип("Структура") Тогда
	Если Не Источник.Свойство("АлкогольнаяПродукция") Тогда
		Источник.Вставить("АлкогольнаяПродукция", Ложь);
	КонецЕсли;
	Если Не Источник.Свойство("ИмпортнаяАлкогольнаяПродукция") Тогда
		Источник.Вставить("ИмпортнаяАлкогольнаяПродукция", Ложь);
	КонецЕсли;
	Если Не Источник.Свойство("ВидАлкогольнойПродукции") Тогда
		Источник.Вставить("ВидАлкогольнойПродукции", Справочники.ВидыАлкогольнойПродукции.ПустаяСсылка());
	КонецЕсли;
КонецЕсли;

ВходящиеДанные.Вставить("АлкогольнаяПродукция");
ВходящиеДанные.Вставить("ВидАлкогольнойПродукции");
ВходящиеДанные.Вставить("ИмпортнаяАлкогольнаяПродукция");
Попытка
	ВходящиеДанные.АлкогольнаяПродукция = Источник.АлкогольнаяПродукция;
Исключение
	ВходящиеДанные.АлкогольнаяПродукция = Ложь;
КонецПопытки;
Попытка
	ВходящиеДанные.ИмпортнаяАлкогольнаяПродукция = Источник.ИмпортнаяАлкогольнаяПродукция;
Исключение
	ВходящиеДанные.ИмпортнаяАлкогольнаяПродукция = Ложь;
КонецПопытки;
Попытка
	ВходящиеДанные.ВидАлкогольнойПродукции = Источник.ВидАлкогольнойПродукции;
Исключение
	ВходящиеДанные.ВидАлкогольнойПродукции = Неопределено;
КонецПопытки;

Если ТипЗнч(Источник) = Тип("Структура") Тогда
	
	ВходящиеДанные.Вставить("Наименование",					Лев(СокрЛП(Источник.Наименование), 50));
	ВходящиеДанные.Вставить("ИспользованиеХарактеристик",	Источник.ИспользованиеХарактеристик);
	ВходящиеДанные.Вставить("ИспользоватьСерии",			Источник.ИспользоватьСерии);
	
Иначе
	
	// Если передали объект, то на данный вид номенклатуры нет ссылок, выгружаем все по-минимуму
	ВходящиеДанные.Вставить("ИспользованиеХарактеристик", "НеИспользовать");
	
	Если ВходящиеДанные.АлкогольнаяПродукция Тогда
		Постфикс = "(" + НСтр("ru='б/х'") + ", " + НСтр("ru='алко'") + ")";
	Иначе	
		Постфикс = "(" + НСтр("ru='б/х'") + ")";
	КонецЕсли;	
	
	ВходящиеДанные.Вставить("Наименование", Лев(СокрЛП(Источник.Наименование), 49-СтрДлина(Постфикс)) + " " + Постфикс);
	ВходящиеДанные.Вставить("ИспользоватьСерии", Ложь);
	
КонецЕсли;
