Запрос = Новый Запрос("ВЫБРАТЬ
                      |	&ДатаОстатков КАК ДатаПлатежа,
                      |	ВзаиморасчетыСКонтрагентамиОстатки.Организация КАК Организация,
                      |	ВзаиморасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
                      |	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
                      |	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Партнер,
                      |	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК Сумма,
                      |	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * ВЫБОР
                      |		КОГДА ЕСТЬNULL(КурсыВалют.Курс, 0) > 0
                      |				И ЕСТЬNULL(КурсыВалют.Кратность, 0) > 0
                      |			ТОГДА КурсыВалют.Курс / КурсыВалют.Кратность
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаРегл,
                      |	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаУпр,
                      |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
                      |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента
                      |ПОМЕСТИТЬ ОстаткиВзаиморасчетов
                      |ИЗ
                      |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.Прочее)) КАК ВзаиморасчетыСКонтрагентамиОстатки
                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатков, ) КАК КурсыВалют
                      |		ПО ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалют.Валюта
                      |ГДЕ
                      |	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток < 0
                      |;
                      |
                      |////////////////////////////////////////////////////////////////////////////////
                      |ВЫБРАТЬ
                      |	ОстаткиВзаиморасчетов.ДатаПлатежа,
                      |	ОстаткиВзаиморасчетов.Организация КАК Организация,
                      |	ОстаткиВзаиморасчетов.Контрагент КАК Контрагент,
                      |	ОстаткиВзаиморасчетов.Партнер,
                      |	СУММА(ОстаткиВзаиморасчетов.Сумма) КАК Сумма,
                      |	СУММА(ОстаткиВзаиморасчетов.СуммаРегл) КАК СуммаРегл,
                      |	СУММА(ОстаткиВзаиморасчетов.СуммаУпр) КАК СуммаУпр,
                      |	ОстаткиВзаиморасчетов.ВалютаВзаиморасчетов,
                      |	ОстаткиВзаиморасчетов.ДоговорКонтрагента КАК ОбъектРасчетов
                      |ИЗ
                      |	ОстаткиВзаиморасчетов КАК ОстаткиВзаиморасчетов
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ОстаткиВзаиморасчетов.ДатаПлатежа,
                      |	ОстаткиВзаиморасчетов.Организация,
                      |	ОстаткиВзаиморасчетов.Контрагент,
                      |	ОстаткиВзаиморасчетов.Партнер,
                      |	ОстаткиВзаиморасчетов.ВалютаВзаиморасчетов,
                      |	ОстаткиВзаиморасчетов.ДоговорКонтрагента
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Контрагент
                      |ИТОГИ ПО
                      |	Организация
                      |АВТОУПОРЯДОЧИВАНИЕ");
	
Если Параметры.Организации.Количество() > 0 Тогда
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ", 
								"Организация В (&МассивОрганизаций) И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ");
	Запрос.УстановитьПараметр("МассивОрганизаций", Параметры.Организации);
КонецЕсли;	

Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Параметры.ДатаОстатков));

ВыборкаДанных = Новый ТаблицаЗначений;
ВыборкаДанных.Колонки.Добавить("Дата");
ВыборкаДанных.Колонки.Добавить("Организация");
ВыборкаДанных.Колонки.Добавить("РасчетыСПартнерами");

РезультатыЗапроса = Запрос.Выполнить();
ВыборкаПоОрганизациям = РезультатыЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Пока ВыборкаПоОрганизациям.Следующий() Цикл
	
	НоваяСтрока = ВыборкаДанных.Добавить();
	НоваяСтрока.Дата        = КонецДня(Параметры.ДатаОстатков); 
	НоваяСтрока.Организация = ВыборкаПоОрганизациям.Организация; 
	
	РасчетыСПартнерами = Неопределено;
	Выполнить(Алгоритмы.ТаблицаРасчетовСПартнерами);
	НоваяСтрока.РасчетыСПартнерами = РасчетыСПартнерами;
	
	ВыборкаДетальныеЗаписи = ВыборкаПоОрганизациям.Выбрать(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		НоваяСтрокаРасчетыСПартнерами = НоваяСтрока.РасчетыСПартнерами.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыСПартнерами, ВыборкаДетальныеЗаписи);
	
	КонецЦикла;
	
КонецЦикла;

Выполнить(Алгоритмы.ОчисткаВыборки);
