Для Каждого Документ Из Параметры.ДокументыДляПроведения Цикл
	
	Если Не Документ.ЭтоНовый() Тогда
		
		// Переполучаем объект, т.к. он мог быть изменен
		ДокументОбъект = Документ.Ссылка.ПолучитьОбъект();
		
		УстановитьОбменДаннымиЗагрузка(ДокументОбъект, Ложь);
		
		Попытка
			
			Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			
				ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных");
				
				// выполняем попытку проведения документа
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
		Исключение
		КонецПопытки;
	Иначе
		Попытка
			ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
			ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных");
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецЦикла;
