Если ПараметрыОбъекта <> Неопределено Тогда
	Если ПараметрыОбъекта["ПредъявленСчетФактура"] Тогда
		Элемент = Новый Структура("Объект,НомерСчетаФактуры,ДатаСчетаФактуры",
			Объект,ПараметрыОбъекта["НомерСчетаФактуры"],ПараметрыОбъекта["ДатаСчетаФактуры"]);
		Параметры.ВводОстатковСчетаФактуры.Добавить(Элемент);
	КонецЕсли;
КонецЕсли;

Выполнить(Алгоритмы.УстановитьОтветственногоВДокумент);

Если Объект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад тогда
	Объект.НалогообложениеНДС = УчетНДСУП.ПараметрыУчетаПоОрганизации(Объект.Организация, ТекущаяДата(), Неопределено).ОсновноеНалогообложениеНДСПродажи;
Иначе
	Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД;
КонецЕсли;

Объект.ВидДеятельностиНДС = Справочники.Организации.ЗакупкаПодДеятельность(Объект.Организация, Объект.Склад, Объект.Дата);

Параметры.ДокументыДляПроведения.Добавить(Объект);
