Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	Штрихкоды.Штрихкод
                      |ИЗ
                      |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
                      |		ПО (Штрихкоды.Владелец = ИнформационныеКарты.Ссылка)
                      |ГДЕ
                      |	ИнформационныеКарты.Ссылка = &Ссылка");
					  
Запрос.УстановитьПараметр("Ссылка", Источник);
Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();
Значение = Выборка.Штрихкод;
