Если ИмяПКО = "Номенклатура" Тогда
	
	Если Не ЗначениеЗаполнено(Объект.ИспользованиеХарактеристик) Тогда
		
		ИспользованиеХарактеристикВидаНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры,"ИспользованиеХарактеристик");
			
		Если Не ЗначениеЗаполнено(ИспользованиеХарактеристикВидаНоменклатуры) Тогда
			Объект.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
		Иначе
			Объект.ИспользованиеХарактеристик = ИспользованиеХарактеристикВидаНоменклатуры;
		КонецЕсли;
		
	КонецЕсли;
	
ИначеЕсли ИмяПКО = "ФайлыНоменклатуры" 
	Или ИмяПКО = "ФайлыПартнеров"
	Или ИмяПКО = "ФайлыПроектов"
	Или ИмяПКО = "ФайлыФизическихЛиц"
	Или ИмяПКО = "ФайлыСоглашенийСКлиентами"
	Или ИмяПКО = "ФайлыСоглашенийСПоставщиками" Тогда
	
	РаботаСФайламиСлужебный.ЗаписатьФайлВИнформационнуюБазу(Объект.Ссылка, Объект.ФайлХранилище.Получить());
	
ИначеЕсли ИмяПКО = "ДоговорСПокупателемСоглашениеСКомиссионером"
	Или ИмяПКО = "ДоговорСПокупателемСоглашениеСКлиентом" Тогда
	
	//Заполним служебный реквизит вариант расчета цен
	Объект.ЗаполнитьВариантРасчетаЦен();
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
КонецЕсли;
