ВЫБРАТЬ РАЗЛИЧНЫЕ
	ВзаиморасчетыСКонтрагентамиОстатки.Сделка
ПОМЕСТИТЬ Заказы
ИЗ
	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
			&ДатаОстатков,
			Сделка ССЫЛКА Документ.ЗаказПоставщику
				И Сделка <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)) КАК ВзаиморасчетыСКонтрагентамиОстатки
ГДЕ
	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток <> 0
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗЛИЧНЫЕ
	Заказы.Сделка КАК Ссылка
ИЗ
	Заказы КАК Заказы
