Выполнить(Алгоритмы.УстановитьМенеджераВДокумент);

Если Не ЗначениеЗаполнено(Объект.НалогообложениеНДС) Тогда
	Объект.НалогообложениеНДС = УчетНДСУП.ПараметрыУчетаПоОрганизации(Объект.Организация, ТекущаяДата(), Неопределено).ОсновноеНалогообложениеНДСПродажи;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.ЗакупкаПодДеятельность) И Не Объект.ЗакупкаПодДеятельностьОпределяетсяВДокументе Тогда				
	Объект.ЗакупкаПодДеятельностьОпределяетсяВДокументе = Истина;				
КонецЕсли;

Объект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(Объект.ВалютаВзаиморасчетов);

Объект.ХозяйственнаяОперация = Справочники.ДоговорыКонтрагентов.ХозяйственнаяОперация(Объект.ТипДоговора,
	Объект.ВариантОформленияЗакупок);

Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов и ЗначениеЗаполнено(Объект.Дата) и ЗначениеЗаполнено(Объект.Номер) Тогда
	Объект.ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(Объект);
Иначе
	Объект.ИдентификаторПлатежа = Неопределено;
КонецЕсли;
