Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка,
	|	БанковскиеСчета.ПометкаУдаления,
	|	БанковскиеСчета.Владелец,
	|	БанковскиеСчета.Код,
	|	БанковскиеСчета.Наименование,
	|	БанковскиеСчета.НомерСчета,
	|	БанковскиеСчета.Банк,
	|	БанковскиеСчета.БанкДляРасчетов,
	|	БанковскиеСчета.ТекстКорреспондента,
	|	БанковскиеСчета.ТекстНазначения,
	|	БанковскиеСчета.ВалютаДенежныхСредств,
	|	БанковскиеСчета.СуммаБезКопеек КАК ВыводитьСуммуБезКопеек,
	|	ВЫБОР КОГДА БанковскиеСчета.МесяцПрописью ТОГДА
	|		""Прописью""
	|	ИНАЧЕ
	|		""Числом""
	|	КОНЕЦ КАК ВариантВыводаМесяца
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец ССЫЛКА Справочник.Организации
	|");
	
Если Параметры.Организации.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И БанковскиеСчета.Владелец В (&МассивОрганизаций)";
	Запрос.УстановитьПараметр("МассивОрганизаций", Параметры.Организации);
КонецЕсли;

ВыборкаДанных = Запрос;
