// Определим склады, у которых не заполнена настройка контроля остатков
Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Склады.Ссылка,
	|	Склады.КонтролироватьОбеспечение КАК КонтролироватьОбеспечение
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспечения
	|		ПО (НастройкаКонтроляОбеспечения.Склад = Склады.Ссылка)
	|ГДЕ
	|	(НЕ Склады.ЭтоГруппа)
	|	И НастройкаКонтроляОбеспечения.Склад ЕСТЬ NULL");
	
ВыборкаСкладов = Запрос.Выполнить().Выбрать();

Пока ВыборкаСкладов.Следующий() Цикл
	
	МенеджерЗаписи = РегистрыСведений.НастройкаКонтроляОбеспечения.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Склад          = ВыборкаСкладов.Ссылка;
	МенеджерЗаписи.Контролировать = ВыборкаСкладов.КонтролироватьОбеспечение;
	
	МенеджерЗаписи.Записать();
	
КонецЦикла;
