Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка                                   КАК Ссылка,
	|	ДоговорыКонтрагентов.ТипЦен.ЦенаВключаетНДС                   КАК ЦенаВключаетНДС,
	|	ДоговорыКонтрагентов.Владелец                                 КАК Владелец,
	|	ДоговорыКонтрагентов.Наименование                             КАК Наименование,
	|	ДоговорыКонтрагентов.ПометкаУдаления                          КАК ПометкаУдаления,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов                     КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах				  КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.Комментарий                              КАК Комментарий,
	|	ДоговорыКонтрагентов.СрокДействия                             КАК СрокДействия,
	|	ДоговорыКонтрагентов.Организация                              КАК Организация,
	|	ДоговорыКонтрагентов.ПроцентКомиссионногоВознаграждения       КАК ПроцентКомиссионногоВознаграждения,
	|	ДоговорыКонтрагентов.СпособРасчетаКомиссионногоВознаграждения КАК СпособРасчетаКомиссионногоВознаграждения,
	|	ДоговорыКонтрагентов.Дата                                     КАК Дата,
	|	ДоговорыКонтрагентов.Номер                                    КАК Номер
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)
	|	И (НЕ ДоговорыКонтрагентов.ЭтоГруппа)
	|");

Если Параметры.Организации.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + "
	|	И ДоговорыКонтрагентов.Организация В (&МассивОрганизаций) ";
	Запрос.УстановитьПараметр("МассивОрганизаций", Параметры.Организации);
КонецЕсли;

ВыборкаДанных = Запрос;
