// Определим склады, по которым есть документы ввода остатков с сериями
Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВводОстатковСерии.Ссылка.Склад КАК Склад
	|ИЗ
	|	Документ.ВводОстатков.Серии КАК ВводОстатковСерии
	|ГДЕ
	|	НЕ ВводОстатковСерии.Ссылка.ПометкаУдаления
	|	И НЕ ВводОстатковСерии.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
	|	И НЕ ВводОстатковСерии.Ссылка.Склад.ИспользоватьСерииНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводОстатковСерии.Ссылка.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВводОстатковТовары.Ссылка.Склад
	|ИЗ
	|	Документ.ВводОстатков.Товары КАК ВводОстатковТовары
	|ГДЕ
	|	ВводОстатковТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И НЕ ВводОстатковТовары.Ссылка.ПометкаУдаления
	|	И НЕ ВводОстатковТовары.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
	|	И НЕ ВводОстатковТовары.Ссылка.Склад.ИспользоватьСерииНоменклатуры");
	
ВыборкаСкладов = Запрос.Выполнить().Выбрать();
Пока ВыборкаСкладов.Следующий() Цикл
	
	Объект = ВыборкаСкладов.Склад.ПолучитьОбъект();
	УстановитьОбменДаннымиЗагрузка(Объект);
	Объект.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = Истина;
	Объект.ИспользоватьСерииНоменклатуры = Истина;
	Объект.Записать();
	
КонецЦикла;
