ПодходящийРежимСерий = 1;
Если ИмяТЧ = Неопределено Или ИмяТЧ = "Товары" Тогда
	ПодходящийРежимСерий = 2;
КонецЕсли;

Если Параметры.РежимВыгрузкиСерий = ПодходящийРежимСерий Тогда
	Номенклатура = ОбъектКоллекции.Номенклатура;
	
	ПараметрыПоиска = Новый Структура("Номенклатура", Номенклатура);
	НайденныеСтроки = Параметры.ТабАлкогольнаяПродукцияНоменклатуры.НайтиСтроки(ПараметрыПоиска);

	Если НайденныеСтроки.Количество() > 0 Тогда
		ВходящиеДанные.Вставить("АлкогольнаяПродукция",    НайденныеСтроки[0].АлкогольнаяПродукция);
		ВходящиеДанные.Вставить("ВидАлкогольнойПродукции", НайденныеСтроки[0].ВидАлкогольнойПродукции);
		ВходящиеДанные.Вставить("ВестиУчетПоГТД",          НайденныеСтроки[0].ВестиУчетПоГТД);
	Иначе

		// ВидАлкогольнойПродукции и АлкогольнаяПродукция
		Запрос = Новый Запрос;
		Запрос.Текст = "
			|ВЫБРАТЬ
			|	СведенияОбАлкогольнойПродукции.ВидПродукции,
			|	СведенияОбАлкогольнойПродукции.ВидЛицензии
			|ИЗ
			|	РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
			|ГДЕ
			|	СведенияОбАлкогольнойПродукции.Номенклатура = &Номенклатура";
			
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВходящиеДанные.Вставить("АлкогольнаяПродукция", Истина);
			ВходящиеДанные.Вставить("ВидАлкогольнойПродукции", Выборка.ВидПродукции);
		Иначе
			ВходящиеДанные.Вставить("АлкогольнаяПродукция", Ложь);
			ВходящиеДанные.Вставить("ВидАлкогольнойПродукции", Справочники.ВидыАлкогольнойПродукции.ПустаяСсылка());
		КонецЕсли;

		// Вести учет по ГТД
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
		|	И СерииНоменклатуры.Владелец = &Номенклатура
		|");

		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

		ВходящиеДанные.Вставить("ВестиУчетПоГТД", Не Запрос.Выполнить().Пустой());
	КонецЕсли;	
		
	СоздатьВидНоменклатуры_Номенклатура					= Номенклатура;
	СоздатьВидНоменклатуры_НаименованиеВидаНоменклатуры = Номенклатура.ВидНоменклатуры.Наименование;
	СоздатьВидНоменклатуры_ТипНоменклатуры				= Номенклатура.ВидНоменклатуры.ТипНоменклатуры;
	СоздатьВидНоменклатуры_ИспользоватьСерии			= Истина;
	
	СоздатьВидНоменклатуры_ИмпортнаяАлкогольнаяПродукция = ВходящиеДанные.АлкогольнаяПродукция И ВходящиеДанные.ВестиУчетПоГТД;
	СоздатьВидНоменклатуры_АлкогольнаяПродукция          = ВходящиеДанные.АлкогольнаяПродукция;
	СоздатьВидНоменклатуры_ВидАлкогольнойПродукции       = ВходящиеДанные.ВидАлкогольнойПродукции;
	Выполнить(Алгоритмы.СоздатьВидНоменклатуры);

	ИсходящиеДанные = Новый Структура("ВидНоменклатуры", Значение);

	Значение = ОбъектКоллекции.Серия;
	Если НЕ ЗначениеЗаполнено(ОбъектКоллекции.Серия) Тогда
		Значение = "1";
		ИмяПКО = "НеизвестнаяСерия";
	КонецЕсли;
Иначе
	Отказ = Истина;
КонецЕсли;
