ВходящиеДанные = Новый Структура("ТипКарты,Персонализирована");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МАКСИМУМ(ИнформационныеКарты.ВидКарты) КАК ТипКарты,
                      |	МАКСИМУМ(ВЫБОР
                      |			КОГДА (ВЫРАЗИТЬ(ИнформационныеКарты.ВладелецКарты КАК Справочник.Контрагенты)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЛОЖЬ
                      |		КОНЕЦ) КАК Персонализирована,
                      |	ИнформационныеКарты.ВладелецКарты
                      |ИЗ
                      |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
                      |ГДЕ
                      |	ИнформационныеКарты.ВидДисконтнойКарты = &ВидДисконтнойКарты
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ИнформационныеКарты.ВладелецКарты");
					  
Запрос.УстановитьПараметр("ВидДисконтнойКарты", Источник);
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ЗаполнитьЗначенияСвойств(ВходящиеДанные, Выборка);
КонецЕсли;
