Запрос = Новый Запрос("ВЫБРАТЬ
|	УстановкаЦенНоменклатурыВидыЦен.Ссылка,
|	МИНИМУМ(ВЫБОР
|			КОГДА УстановкаЦенНоменклатурыВидыЦен.ВидЦены <> &ВидЦены
|				ТОГДА ЛОЖЬ
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ) КАК Статус
|ПОМЕСТИТЬ АнализДокументов
|ИЗ
|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК УстановкаЦенНоменклатурыВидыЦен
|ГДЕ
|	НАЧАЛОПЕРИОДА(УстановкаЦенНоменклатурыВидыЦен.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
|	И УстановкаЦенНоменклатурыВидыЦен.Ссылка.Комментарий ПОДОБНО &Комментарий
|
|СГРУППИРОВАТЬ ПО
|	УстановкаЦенНоменклатурыВидыЦен.Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	АнализДокументов.Ссылка
|ИЗ
|	АнализДокументов КАК АнализДокументов
|ГДЕ
|	АнализДокументов.Статус = ИСТИНА");

Запрос.УстановитьПараметр("Дата", СвойстваПоиска.Получить("Дата"));
Запрос.УстановитьПараметр("Комментарий", СвойстваПоиска.Получить("Комментарий"));
Запрос.УстановитьПараметр("ВидЦены", ПараметрыОбъекта.Получить("ВидЦены"));

Выборка = Запрос.Выполнить().Выбрать();

Если Выборка.Следующий() Тогда
	СсылкаНаОбъект = Выборка.Ссылка;
КонецЕсли;

ПрекратитьПоиск = Истина;
