ТабВыборки = Новый ТаблицаЗначений;
ТабВыборки.Колонки.Добавить("Владелец");
ТабВыборки.Колонки.Добавить("ДатаНачала");
ТабВыборки.Колонки.Добавить("ДатаОкончания");
ТабВыборки.Колонки.Добавить("ОтветственноеЛицо");
ТабВыборки.Колонки.Добавить("ФизическоеЛицо");
ТабВыборки.Колонки.Добавить("Наименование");

Запрос = Новый Запрос;
Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОтветственныеЛицаОрганизации.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтветственныеЛицаОрганизации.Должность КАК Должность,
	|	ОтветственныеЛицаОрганизации.Период КАК Период
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизации КАК ОтветственныеЛицаОрганизации
	|ГДЕ
	|	ОтветственныеЛицаОрганизации.Период >= &ДатаОстатков
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.СтруктурнаяЕдиница,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&ДатаОстатков, ) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ,
	|	СтруктурнаяЕдиница
	|ИТОГИ ПО
	|	СтруктурнаяЕдиница,
	|	ОтветственноеЛицо";
	
Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Параметры.ДатаОстатков));

Если Параметры.Организации.Количество() > 0 Тогда
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ">= &ДатаОстатков", 
								">= &ДатаОстатков И ОтветственныеЛицаОрганизации.СтруктурнаяЕдиница В (&МассивОрганизаций)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОтветственныеЛицаОрганизацииСрезПоследних", 
								"КАК ОтветственныеЛицаОрганизацииСрезПоследних
								|ГДЕ
								|	ОтветственныеЛицаОрганизацииСрезПоследних.СтруктурнаяЕдиница В (&МассивОрганизаций)");
								
	Запрос.УстановитьПараметр("МассивОрганизаций", Параметры.Организации);							
КонецЕсли;

Результат = Запрос.Выполнить();

ВыборкаОрганизаций = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Пока ВыборкаОрганизаций.Следующий() Цикл
	ВыборкаОтвЛиц = ВыборкаОрганизаций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОтвЛиц.Следующий() Цикл
		ПредыдущаяДата = ДАТА(1,1,1,0,0,0);
		ВыборкаДетальныеЗаписи = ВыборкаОтвЛиц.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока						= ТабВыборки.Добавить();
			НоваяСтрока.Владелец			= ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
			НоваяСтрока.ДатаНачала			= ВыборкаДетальныеЗаписи.Период;
			НоваяСтрока.ДатаОкончания		= ПредыдущаяДата;
			ПредыдущаяДата					= ВыборкаДетальныеЗаписи.Период;
			НоваяСтрока.ОтветственноеЛицо	= ВыборкаДетальныеЗаписи.ОтветственноеЛицо;
			НоваяСтрока.ФизическоеЛицо		= ВыборкаДетальныеЗаписи.ФизическоеЛицо;
			НоваяСтрока.Наименование		= ВыборкаДетальныеЗаписи.ФизическоеЛицо.Наименование;
		КонецЦикла;
	КонецЦикла;
КонецЦикла;

ВыборкаДанных = ТабВыборки;
