Параметры.МассивЗагруженныхПартнеров.Добавить(Объект);

//КоличествоСтрок = Объект.КонтактнаяИнформация.Количество();
//Для ОбратныйИндекс = 1 По КоличествоСтрок Цикл
//	
//	Строка = Объект.КонтактнаяИнформация.Получить(КоличествоСтрок - ОбратныйИндекс);
//	НаименованиеВида = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Строка.Вид, "Наименование");
//	
//	Если Не Параметры.ЭтоБазоваяВерсия Или НаименованиеВида = НСтр("ru='Юридический адрес юр.лица'") Тогда
//		Если Строка.Вид <> Справочники.ВидыКонтактнойИнформации.АдресПартнера
//			И Строка.Вид <> Справочники.ВидыКонтактнойИнформации.ТелефонПартнера
//			И Строка.Вид <> Справочники.ВидыКонтактнойИнформации.EmailПартнера Тогда
//			
//			Объект.КонтактнаяИнформация.Удалить(Строка);
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецЦикла;
