Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка КАК Ссылка,
	|	ЕдиницыИзмерения.Вес КАК Вес,
	|	ЕдиницыИзмерения.Объем КАК Объем,
	|	ЕдиницыИзмерения.Владелец КАК Владелец,
	|	ВЫБОР КОГДА ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).ЕдиницаХраненияОстатков.Коэффициент <> 0 ТОГДА
	|		ЕдиницыИзмерения.Коэффициент / ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).ЕдиницаХраненияОстатков.Коэффициент
	|	ИНАЧЕ
	|		ЕдиницыИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаПоКлассификатору,
	|	ЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления,
	|	ЕдиницыИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).ЕдиницаХраненияОстатков <> ЕдиницыИзмерения.Ссылка
	|	ИЛИ ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).ЕдиницаХраненияОстатков.Коэффициент <> 1
	|");

ВыборкаДанных = Запрос;
