ВидНоменклатуры = Объект.ВидНоменклатуры;
Номер			= Объект.Номер;
ГоденДо			= Объект.ГоденДо;

// {{ Справочники.СерииНоменклатуры.МодульОбъекта.ПередЗаписью
	ПараметрыШаблона = ЗначениеНастроекПовтИсп.НастройкиИспользованияСерий(ВидНоменклатуры);
	
	Номер = СокрЛП(Номер);
	
	Если ПараметрыШаблона.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ГоденДо = НачалоЧаса(ГоденДо);
	Иначе
		ГоденДо = НачалоДня(ГоденДо);
	КонецЕсли;
	
	Наименование = НоменклатураКлиентСервер.ПредставлениеСерии(ПараметрыШаблона, Объект);
// }} Справочники.СерииНоменклатуры.МодульОбъекта.ПередЗаписью

Объект.Наименование = Наименование;
Объект.ГоденДо = ГоденДо;
Объект.Номер = Номер;
