Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КассыККМ.Ссылка КАК КассаККМ,
	|	ОтчетОРозничныхПродажах.Склад КАК Склад
	|ПОМЕСТИТЬ КассыИСклады
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ПО КассыККМ.Ссылка = ОтчетОРозничныхПродажах.КассаККМ
	|			И (ОтчетОРозничныхПродажах.Проведен = ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КассаККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(КассыИСклады.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	ВЫБОР
	|		КОГДА ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ФискальныйРегистратор)
	|				ИЛИ ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ККМOnline)
	|			ТОГДА ""ФискальныйРегистратор""
	|		КОГДА ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ККМOffline)
	|			ТОГДА ""ККМOffline""
	|		ИНАЧЕ ""АвтономнаяККМ""
	|	КОНЕЦ КАК ТипКассы,
	|	КассыИСклады.КассаККМ.Владелец КАК Владелец,
	|	КассыИСклады.КассаККМ.Наименование КАК Наименование,
	|	КассыИСклады.КассаККМ,
	|	КассыИСклады.КассаККМ.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	КассыИСклады КАК КассыИСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
	|		ПО КассыИСклады.КассаККМ = ТорговоеОборудование.КассаККМ
	|			И (ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ФискальныйРегистратор)
	|				ИЛИ ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ККМOffline)
	|				ИЛИ ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ККМOnline))");
	
Если Параметры.Организации.Количество() > 0 Тогда
	
	Запрос.Текст = Запрос.Текст + " ГДЕ КассыИСклады.КассаККМ.Владелец В (&МассивОрганизаций) ";
	Запрос.УстановитьПараметр("МассивОрганизаций", Параметры.Организации);
	
КонецЕсли;	
	
ВыборкаДанных = Запрос.Выполнить().Выгрузить();
