Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Док.ТипЦен КАК ВидЦены,
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.ХарактеристикаНоменклатуры КАК Характеристика,
	|	МАКСИМУМ(ВЫРАЗИТЬ(Док.Цена * ВЫБОР
	|				КОГДА Док.ТипЦен.ВалютаЦены <> Док.Валюта
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Кратность, 0) > 0
	|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Курс, 0) > 0
	|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
	|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
	|								ТОГДА КурсыСрезПоследнихВалютаЦены.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаЦены.Кратность)
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(10, 2))) КАК Цена,
	|	МАКСИМУМ(ЕСТЬNULL(Док.ЕдиницаИзмерения, 0)) КАК Упаковка
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыСрезПоследнихВалютаЦены
	|		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = Док.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыСрезПоследнихВалютаДокумента
	|		ПО (КурсыСрезПоследнихВалютаДокумента.Валюта = Док.ТипЦен.ВалютаЦены)
	|ГДЕ
	|	Док.Ссылка = &Док
	|	И (Док.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИЛИ Док.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.ТипЦен,
	|	Док.Номенклатура,
	|	Док.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ВидЦены");


Запрос.УстановитьПараметр("Док",  Источник);
Запрос.УстановитьПараметр("ДатаДокумента", Источник.Дата);

КоллекцияОбъектов = Запрос.Выполнить().Выгрузить();
