Если Источник.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов Тогда
	Значение = "СправочникКонтактныеЛицаПартнеров";
ИначеЕсли Источник.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты Тогда
	Значение = "СправочникКонтрагенты";
ИначеЕсли Источник.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Организации Тогда
	Значение = "СправочникОрганизации";
ИначеЕсли Источник.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи Тогда
	Значение = "СправочникПользователи";
ИначеЕсли Источник.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица Тогда
	Значение = "СправочникФизическиеЛица";
КонецЕсли;
