Если Параметры.СворачиватьХарактеристики Тогда
	
	ИмяПКО = "ВидыНоменклатуры";
	СоздатьВидНоменклатуры_Номенклатура                 = ВходящиеДанные.Владелец.Ссылка;
	СоздатьВидНоменклатуры_НаименованиеВидаНоменклатуры = ВходящиеДанные.Владелец.ВидНоменклатуры.Наименование;
	СоздатьВидНоменклатуры_ТипНоменклатуры              = ВходящиеДанные.Владелец.ВидНоменклатуры.ТипНоменклатуры;
	СоздатьВидНоменклатуры_ИспользоватьСерии			= ВходящиеДанные.Владелец.ВестиУчетПоСериям;
	СоздатьВидНоменклатуры_ИмпортнаяАлкогольнаяПродукция = ВходящиеДанные.АлкогольнаяПродукция И ВходящиеДанные.ВестиУчетПоГТД;
	СоздатьВидНоменклатуры_АлкогольнаяПродукция          = ВходящиеДанные.АлкогольнаяПродукция;
	СоздатьВидНоменклатуры_ВидАлкогольнойПродукции       = ВходящиеДанные.ВидАлкогольнойПродукции;
	Выполнить(Алгоритмы.СоздатьВидНоменклатуры);
	
ИначеЕсли ТипЗнч(Значение) <> Тип("Структура") Тогда
	
	// Владельцем характеристики будет являться номенклатура, которая возможно является некачественной
	Если ВходящиеДанные.Свойство("Качество") Тогда
		ИсходящиеДанные.Вставить("Качество", ВходящиеДанные.Качество);
		ИмяПКО = "НекачественнаяНоменклатура";	
	КонецЕсли;
	
КонецЕсли;
