КлючВыгружаемыхДанных = Строка(Источник.Ссылка.УникальныйИдентификатор());
Если ВходящиеДанные.Свойство("Качество") Тогда
	// Переопределяем стандартый ключ выгружаемых данных, т.к. идет выгрузка один ко многим
	КлючВыгружаемыхДанных = КлючВыгружаемыхДанных + Строка(ВходящиеДанные.Качество.УникальныйИдентификатор());
КонецЕсли;

ВходящиеДанные.Вставить("АлкогольнаяПродукция");
ВходящиеДанные.Вставить("ВидАлкогольнойПродукции");
ВходящиеДанные.Вставить("ИмпортнаяАлкогольнаяПродукция");
Попытка
	ВходящиеДанные.АлкогольнаяПродукция = Источник.АлкогольнаяПродукция;
Исключение
	ВходящиеДанные.АлкогольнаяПродукция = Ложь;
КонецПопытки;
Попытка
	ВходящиеДанные.ИмпортнаяАлкогольнаяПродукция = Источник.ИмпортнаяАлкогольнаяПродукция;
Исключение
	ВходящиеДанные.ИмпортнаяАлкогольнаяПродукция = Ложь;
КонецПопытки;
Попытка
	ВходящиеДанные.ВидАлкогольнойПродукции = Источник.ВидАлкогольнойПродукции;
Исключение
	ВходящиеДанные.ВидАлкогольнойПродукции = Неопределено;
КонецПопытки;
