ПервичныйДокумент.Организация              = Источник.Организация;
ПервичныйДокумент.Контрагент               = ОбъектКоллекции.Контрагент;
ПервичныйДокумент.Валюта                   = ОбъектКоллекции.ВалютаВзаиморасчетов;
ПервичныйДокумент.ДатаВходящегоДокумента   = ОбъектКоллекции.ДатаРасчетногоДокумента;
ПервичныйДокумент.НомерВходящегоДокумента  = ОбъектКоллекции.НомерРасчетногоДокумента;
ПервичныйДокумент.СуммаДокумента           = ОбъектКоллекции.Сумма;
ПервичныйДокумент.СуммаРегл                = ОбъектКоллекции.СуммаРегл;

ОбъектРасчетов = ОбъектКоллекции.ОбъектРасчетов;
Если ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
	ПервичныйДокумент.Договор = ОбъектРасчетов;
	ПервичныйДокумент.Комментарий = СокрЛП(ОбъектРасчетов);
ИначеЕсли ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	ПервичныйДокумент.ПорядокРасчетов = "ПоЗаказамНакладным";
	ПервичныйДокумент.Комментарий = СокрЛП(ОбъектРасчетов);
КонецЕсли;

Если НЕ ОбъектКоллекции.Владелец().Колонки.Найти("ДокументРасчетовСКонтрагентом") = Неопределено
	И ЗначениеЗаполнено(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) Тогда
	
	ДокументРасчетовСКонтрагентом = ОбъектКоллекции.ДокументРасчетовСКонтрагентом;	

	ПервичныйДокумент.Комментарий = СокрЛП(ДокументРасчетовСКонтрагентом);
	ТипДокумента = ТипЗнч(ДокументРасчетовСКонтрагентом);

	Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеДопРасходов")
		Или ТипДокумента = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, ДоговорКонтрагента, СуммаДокумента, ДатаВходящегоДокумента, НомерВходящегоДокумента, Дата, Номер");
		ПервичныйДокумент.ТипПервичногоДокумента = "ПриобретениеУПоставщика";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		Или ТипДокумента = Тип("ДокументСсылка.ОтражениеНДСКВычету")
		Или ТипДокумента = Тип("ДокументСсылка.ПоступлениеИзПереработки")
		Или ТипДокумента = Тип("ДокументСсылка.ПоступлениеНМА") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, ДоговорКонтрагента, СуммаДокумента, Дата, Номер");
		ПервичныйДокумент.ТипПервичногоДокумента = "ПриобретениеУПоставщика";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ГТДИмпорт") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, ДоговорКонтрагента, ТаможенныйСбор, ТаможенныйШтраф, Дата, Номер");
		ЗаполнитьЗначенияСвойств(ПервичныйДокумент, ДанныеПервичногоДокумента);
		ПервичныйДокумент.ТипПервичногоДокумента = "ПриобретениеУПоставщика";
		ПервичныйДокумент.СуммаДокумента = ДанныеПервичногоДокумента.ТаможенныйСбор + ДанныеПервичногоДокумента.ТаможенныйШтраф;
		ПервичныйДокумент.СуммаРегл = ПервичныйДокумент.СуммаДокумента;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		Или ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации")
		Или ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке")
		Или ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный")
		Или ТипДокумента = Тип("ДокументСсылка.ОтражениеНачисленияНДС") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, ДоговорКонтрагента, СуммаДокумента, Дата, Номер");
		ПервичныйДокумент.ТипПервичногоДокумента = "РеализацияКлиенту";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, ДоговорКонтрагента, СуммаДокумента, ДатаВходящегоДокумента, НомерВходящегоДокумента, Дата, Номер");
		ПервичныйДокумент.ТипПервичногоДокумента = "РеализацияКлиенту";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ДоговорКонтрагента, СуммаДокумента, ДокументОтгрузки");
		ДанныеПервичногоДокументаОтгрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПервичногоДокумента.ДокументОтгрузки, "Дата, Номер, ВалютаДокумента");

		ПервичныйДокумент.ДатаВходящегоДокумента = ДанныеПервичногоДокументаОтгрузки.Дата;
		ПервичныйДокумент.НомерВходящегоДокумента = ДанныеПервичногоДокументаОтгрузки.Номер;
		ПервичныйДокумент.ВалютаДокумента = ДанныеПервичногоДокументаОтгрузки.ВалютаДокумента;
		ПервичныйДокумент.ТипПервичногоДокумента = "РеализацияКлиенту";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "СуммаДокумента, ВалютаДокумента, Дата, Номер");
		
		ПервичныйДокумент.ТипПервичногоДокумента = "РеализацияКлиенту";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, ДоговорКонтрагента, СуммаДокумента, ДатаВходящегоДокумента, НомерВходящегоДокумента, Дата, Номер");
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПервичногоДокумента.ДоговорКонтрагента, "ВидДоговора");
		ПервичныйДокумент.ТипПервичногоДокумента = "ВнутренняяНакладная";
		Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком 
			Или ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			ПервичныйДокумент.ТипПервичногоДокумента = "ПриобретениеУПоставщика";
		ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
			Или ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
			ПервичныйДокумент.ТипПервичногоДокумента = "РеализацияКлиенту";
		КонецЕсли;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, Дата, Номер, СуммаКтЗадолженности, СуммаДтЗадолженности");
		ПервичныйДокумент.ТипПервичногоДокумента = "ВнутренняяНакладная";
		Если ДанныеПервичногоДокумента.СуммаДтЗадолженности = ДанныеПервичногоДокумента.СуммаКтЗадолженности Тогда
			ПервичныйДокумент.СуммаДокумента = ДанныеПервичногоДокумента.СуммаДтЗадолженности;
		Иначе
			ПервичныйДокумент.СуммаДокумента = ДанныеПервичногоДокумента.СуммаДтЗадолженности - ДанныеПервичногоДокумента.СуммаКтЗадолженности;
		КонецЕсли;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.МодернизацияОС") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "Дата, Номер");
		ПервичныйДокумент.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		ПервичныйДокумент.ТипПервичногоДокумента = "ВнутренняяНакладная";
		ПервичныйДокумент.СуммаДокумента = ДокументРасчетовСКонтрагентом.Оплата.Итог("СуммаОплаты");
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.НачислениеНДСПоСМРХозспособом") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "Дата, Номер");
		ПервичныйДокумент.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		ПервичныйДокумент.ТипПервичногоДокумента = "ВнутренняяНакладная";
		ПервичныйДокумент.СуммаДокумента = ДокументРасчетовСКонтрагентом.СМРхозспособом.Итог("СуммаБезНДС") + ДокументРасчетовСКонтрагентом.СМРхозспособом.Итог("НДС");
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОплатаПлатежнойКартой") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, Дата, Номер");
		ПервичныйДокумент.ТипПервичногоДокумента = "ОплатаОтКлиента";
		ПервичныйДокумент.СуммаДокумента = ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		Если ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа.Количество() = 1 Тогда
			ПервичныйДокумент.Договор = ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа[0].ДоговорКонтрагента;
		КонецЕсли;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, СуммаДокумента, ДатаВходящегоДокумента, НомерВходящегоДокумента, Дата, Номер");
		Если НЕ ЗначениеЗаполнено(ПервичныйДокумент.Договор) И ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа.Количество() > 0 Тогда
			ПервичныйДокумент.Договор = ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа[0].ДоговорКонтрагента;
		КонецЕсли;
		
		ПервичныйДокумент.ТипПервичногоДокумента = "ОплатаОтКлиента";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, СуммаДокумента, Дата, Номер");
		Если НЕ ЗначениеЗаполнено(ПервичныйДокумент.Договор) И ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа.Количество() > 0 Тогда
			ПервичныйДокумент.Договор = ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа[0].ДоговорКонтрагента;
		КонецЕсли;
		
		ПервичныйДокумент.ТипПервичногоДокумента = "ОплатаОтКлиента";
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
		Или ТипДокумента = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРасчетовСКонтрагентом, "ВалютаДокумента, СуммаДокумента, Дата, Номер");
		Если НЕ ЗначениеЗаполнено(ПервичныйДокумент.Договор) И ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа.Количество() > 0 Тогда
			ПервичныйДокумент.Договор = ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа[0].ДоговорКонтрагента;
		КонецЕсли;

		ПервичныйДокумент.ТипПервичногоДокумента = "ОплатаПоставщику";
	Иначе
		ТипКорректен = Ложь;
	КонецЕсли;
	
	Если ТипКорректен Тогда
		
		ЗаполнитьЗначенияСвойств(ПервичныйДокумент, ДанныеПервичногоДокумента); 
		
		Если ДанныеПервичногоДокумента.Свойство("ВалютаДокумента") Тогда
			ПервичныйДокумент.Валюта = ДанныеПервичногоДокумента.ВалютаДокумента;
		КонецЕсли;
		Если ДанныеПервичногоДокумента.Свойство("ДоговорКонтрагента") Тогда
			ПервичныйДокумент.Договор = ДанныеПервичногоДокумента.ДоговорКонтрагента;
		КонецЕсли;
		
	КонецЕсли;
КонецЕсли;
