// Для партнера выгружается только адрес, телефон и e-mail
Выполнить(Алгоритмы.ПереносКИ);

Если Параметры.НезависимоВестиПартнеровИКонтрагентов Тогда
	КоличествоСтрок = КоллекцияОбъектов.Количество();
	Для ОбратныйИндекс = 1 По КоличествоСтрок Цикл
		
		Строка = КоллекцияОбъектов.Получить(КоличествоСтрок - ОбратныйИндекс);
		
		Если Строка.Вид <> Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента
			И Строка.Вид <> Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента
			И Строка.Вид <> Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами Тогда
			
			КоллекцияОбъектов.Удалить(Строка);
			
		КонецЕсли;
		
	КонецЦикла;
Иначе
	
	// И всегда удаляем юр.адрес контрагента, т.к. он из КИ контрагента на форму партнера будет выводиться
	КоличествоСтрок = КоллекцияОбъектов.Количество();
	Для ОбратныйИндекс = 1 По КоличествоСтрок Цикл
		Строка = КоллекцияОбъектов.Получить(КоличествоСтрок - ОбратныйИндекс);
		Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
			КоллекцияОбъектов.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецЕсли;
