Если Не ЗначениеЗаполнено(Объект.НалогообложениеНДС) Тогда
	Объект.НалогообложениеНДС = УчетНДСУП.ПараметрыУчетаПоОрганизации(Объект.Организация, ТекущаяДата(), Неопределено).ОсновноеНалогообложениеНДСПродажи;
КонецЕсли;
Выполнить(Алгоритмы.УстановитьМенеджераВДокумент);

Если Объект.ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным Тогда
	Объект.ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(Объект);
Иначе
	Объект.ИдентификаторПлатежа = Неопределено;	
КонецЕсли;

Параметры.ДокументыДляПроведения.Добавить(Объект);
