ВыборкаДанных = Новый ТаблицаЗначений;
ВыборкаДанных.Колонки.Добавить("Ссылка");
ВыборкаДанных.Колонки.Добавить("Объект");
ВыборкаДанных.Колонки.Добавить("Наименование");
ВыборкаДанных.Колонки.Добавить("ИмяФайла");
ВыборкаДанных.Колонки.Добавить("Хранилище");
ВыборкаДанных.Колонки.Добавить("ПометкаУдаления");
ВыборкаДанных.Колонки.Добавить("ВидДанных");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ХранилищеДополнительнойИнформации.Ссылка,
                      |	ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.Объект КАК Справочник.ФизическиеЛица) КАК Объект,
                      |	ВЫБОР
                      |		КОГДА (ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.Наименование КАК СТРОКА(100))) = (ВЫРАЗИТЬ("""" КАК СТРОКА(100)))
                      |			ТОГДА ВЫБОР
                      |					КОГДА (ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.ИмяФайла КАК СТРОКА(145))) = (ВЫРАЗИТЬ("""" КАК СТРОКА(145)))
                      |						ТОГДА ""Изображение""
                      |					ИНАЧЕ ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.ИмяФайла КАК СТРОКА(145))
                      |				КОНЕЦ
                      |		ИНАЧЕ ХранилищеДополнительнойИнформации.Наименование
                      |	КОНЕЦ КАК Наименование,
                      |	ХранилищеДополнительнойИнформации.ИмяФайла,
                      |	ХранилищеДополнительнойИнформации.Хранилище,
                      |	ХранилищеДополнительнойИнформации.ПометкаУдаления,
                      |	ХранилищеДополнительнойИнформации.ВидДанных
                      |ИЗ
                      |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
                      |ГДЕ
                      |	ХранилищеДополнительнойИнформации.Объект <> НЕОПРЕДЕЛЕНО
                      |	И (НЕ ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.Объект КАК Справочник.ФизическиеЛица) ЕСТЬ NULL )
                      |ИТОГИ ПО
                      |	Объект,
                      |	Наименование");

ВыборкаОбъект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Пока ВыборкаОбъект.Следующий() Цикл
	
	ВыборкаНаименование = ВыборкаОбъект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНаименование.Следующий() Цикл
		
		НомерДляПостфикса = 0;
		ВыборкаФайл = ВыборкаНаименование.Выбрать();
		Пока ВыборкаФайл.Следующий() Цикл
			
			НоваяСтрока = ВыборкаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаФайл);
			
			НоваяСтрока.Наименование = СокрЛП(ВыборкаФайл.Наименование) + ?(НомерДляПостфикса = 0, "", " (" + НомерДляПостфикса + ")");
			
			НомерДляПостфикса = НомерДляПостфикса + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецЦикла;
