ВЫБРАТЬ РАЗЛИЧНЫЕ
	ВзаиморасчетыСКонтрагентамиОстатки.Сделка
ПОМЕСТИТЬ Заказы
ИЗ
	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
			&ДатаОстатков,
			Сделка ССЫЛКА Документ.ЗаказПокупателя
				И Сделка <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ВзаиморасчетыСКонтрагентамиОстатки
ГДЕ
	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток <> 0
;


////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗЛИЧНЫЕ
	Заказы.Сделка КАК Ссылка
ИЗ
	Заказы КАК Заказы
