ТаблицаСоответствияКачественнойИНекачественнойНоменклатуры = Параметры.ТаблицаСоответствияКачественнойИНекачественнойНоменклатуры;

НоваяСтрока = ТаблицаСоответствияКачественнойИНекачественнойНоменклатуры.Добавить();
НоваяСтрока.КачественнаяНоменклатура	= ПараметрыОбъекта.Получить("СсылкаНаКачественнуюНоменклатуру");

Если Объект.ЭтоНовый() Тогда
	Объект.УстановитьСсылкуНового(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор()));
	НоваяСтрока.НекачественнаяНоменклатура = Объект.ПолучитьСсылкуНового();
Иначе
	НоваяСтрока.НекачественнаяНоменклатура	= Ссылка;
КонецЕсли;

Объект.КодДляПоиска = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Объект.Код, Истина);
