СтрокаНаименования = "";

// ++Общий модуль СкидкиНаценкиСкиентСервер.АвтоНаименованиеУсловияПредоставленияСкидки
	ПоКакойНоменклатуре = "";
	Если Объект.ВариантОтбораНоменклатуры = ПредопределенноеЗначение("Перечисление.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.СписокНоменклатуры") Тогда
		// Списка номенклатуры нет
	ИначеЕсли Объект.ВариантОтбораНоменклатуры = ПредопределенноеЗначение("Перечисление.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.СегментНоменклатуры") Тогда
		ПоКакойНоменклатуре = СтрШаблон(НСтр("ru = 'по номенклатуре из сегмента %1'"), Объект.СегментНоменклатурыОграничения);
	ИначеЕсли Объект.ВариантОтбораНоменклатуры = ПредопределенноеЗначение("Перечисление.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.ОтборКомпоновкиДанных") Тогда
		ПоКакойНоменклатуре = НСтр("ru = 'по отобранной номенклатуре'");
	КонецЕсли;
	
	Если Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаВремяПродажи") Тогда
		СтрокаНаименования = НСтр("ru = 'Время продажи:'");
		ПервыйДень = Истина;
		Для Каждого СтрокаТаблицы Из Объект.ВремяДействия Цикл
			СтрокаНаименования = СтрокаНаименования + 
			                     ?(ПервыйДень," ", ", ")+ СтрокаТаблицы.ДеньНедели + 
			                     СтрШаблон(НСтр("ru = '(с %1 до %2)'"), Формат(СтрокаТаблицы.ВремяНачала,"ДФ=ЧЧ:мм"), Формат(СтрокаТаблицы.ВремяОкончания,"ДФ=ЧЧ:мм"));
			ПервыйДень = Ложь;
		КонецЦикла;
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаФормуОплаты") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Форма оплаты: %1'"), Объект.ФормаОплаты);
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДеньРожденияКлиента") Тогда
		СтрокаНаименования = НСтр("ru = 'День рождения клиента'");
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ВхождениеПартнераВСегмент") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Клиент входит в сегмент: %1'"), Объект.СегментПартнеров);
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаГрафикОплаты") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'График оплаты: %1'"), Объект.ГрафикОплаты);
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.КартаЛояльностиНеЗарегистрирована") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Карта лояльности ""%1"" не зарегистрирована'"), Объект.ВидКартыЛояльности);
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНаличиеКартыЛояльности") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Клиент владелец карты лояльности ""%1""'"), Объект.ВидКартыЛояльности);
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ОграничениеПоГруппеПользователей") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Группа пользователей: %1'"), Объект.ГруппаПользователей);
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж") Тогда
		
		Если Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Количество в документе %1 %2 ед. %3'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				ПоКакойНоменклатуре);
		ИначеЕсли Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.КоличествоРазличных") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Количество различных наименований в документе %1 %2 шт. %3'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				ПоКакойНоменклатуре);
		ИначеЕсли Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.КоличествоОдинаковых") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Количество одинаковых позиций в документе %1 %2 ед. %3'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				ПоКакойНоменклатуре);
		ИначеЕсли Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Сумма") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Сумма в документе %1 %2 %3 %4'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				Объект.ВалютаОграничения,
				ПоКакойНоменклатуре);
		КонецЕсли;
		
	ИначеЕсли Объект.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж") Тогда
	
		Если Объект.ВариантОпределенияПериодаНакопительнойСкидки = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияПериодаНакопительнойСкидки.ВесьПериод") Тогда
			
			Период = НСтр("ru = 'за весь период'");
			
		ИначеЕсли Объект.ВариантОпределенияПериодаНакопительнойСкидки = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияПериодаНакопительнойСкидки.ПрошлыйПериод") Тогда
			
			Строка = "";
			Если Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
				Строка = НСтр("ru = 'прошлый год,прошлых года,прошлых лет'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
				Строка = НСтр("ru = 'прошлую декаду,прошлых декады,прошлых декад'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
				Строка = НСтр("ru = 'прошлый день,прошлых дня,прошлых дней'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
				Строка = НСтр("ru = 'прошлый квартал,прошлых квартала,прошлых кварталов'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
				Строка = НСтр("ru = 'прошлый месяц,прошлых месяца,прошлых месяцев'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
				Строка = НСтр("ru = 'прошлую неделю,прошлых недели,прошлых недель'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
				Строка = НСтр("ru = 'прошлое полугодие,прошлых полугодия,прошлых полугодий'");
			КонецЕсли;
			
			Период = СтрШаблон(НСтр("ru='за %1'"), СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Объект.КоличествоПериодовНакопления, Строка));
			
		ИначеЕсли Объект.ВариантОпределенияПериодаНакопительнойСкидки = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияПериодаНакопительнойСкидки.СНачалаТекущегоПериода") Тогда
			
			Если Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
				Период = НСтр("ru = 'с начала текущего года'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
				Период = НСтр("ru = 'с начала текущей декады'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
				Период = НСтр("ru = 'с начала текущего дня'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
				Период = НСтр("ru = 'с начала текущего квартала'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
				Период = НСтр("ru = 'с начала текущего месяца'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
				Период = НСтр("ru = 'с начала текущей недели'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
				Период = НСтр("ru = 'с начала текущего полугодия'");
			КонецЕсли;
			
		ИначеЕсли Объект.ВариантОпределенияПериодаНакопительнойСкидки = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияПериодаНакопительнойСкидки.ПрошлыйСкользящийПериод") Тогда
			
			Строка = "";
			Если Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
				Строка = НСтр("ru = 'предыдущий год,продыдущих года,предыдущих лет'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
				Строка = НСтр("ru = 'предыдущее полугодие,предыдущих полугодия,предыдущих полугодий'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
				Строка = НСтр("ru = 'предыдущий квартал,предыдущих квартала,предыдущих кварталов'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
				Строка = НСтр("ru = 'предыдущий месяц,предыдущих месяца,предыдущих месяцев'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
				Строка = НСтр("ru = 'предыдущую декаду,предыдущих декады,предыдущих декад'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
				Строка = НСтр("ru = 'предыдущую неделю,предыдущих недель,предыдущих недель'");
			ИначеЕсли Объект.ПериодНакопления = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
				Строка = НСтр("ru = 'предыдущий день,предыдущих дня,предыдущих дней'");
			КонецЕсли;
			
			Период = СтрШаблон(НСтр("ru='за %1'"), СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Объект.КоличествоПериодовНакопления, Строка));
			
		КонецЕсли;
		
		ВариантНакопления = ?(Объект.ВариантНакопления = ПредопределенноеЗначение("Перечисление.ВариантыНакопленияКумулятивнойСкидкиНаценки.ПоПартнеру"), НСтр("ru = 'по клиенту'"), НСтр("ru = 'по торговому соглашению'"));
		
		Если Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Количество проданной номенклатуры %4 %1 %2 ед. %3'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				ПоКакойНоменклатуре,
				ВариантНакопления);
		ИначеЕсли Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.КоличествоРазличных") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Количество различных наименований проданной номенклатуры %4 %1 %2 шт. %3'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				ПоКакойНоменклатуре,
				ВариантНакопления);
		ИначеЕсли Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.КоличествоОдинаковых") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Количество одинаковых позиций проданной номенклатуры %4 %1 %2 ед. %3'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				ПоКакойНоменклатуре,
				ВариантНакопления);
		ИначеЕсли Объект.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Сумма") Тогда
			СтрокаНаименования = СтрШаблон(
				НСтр("ru = 'Сумма проданной номенклатуры %5 %1 %2 %3 %4'"),
				Объект.ТипСравнения,
				Объект.ЗначениеУсловияОграничения,
				Объект.ВалютаОграничения,
				ПоКакойНоменклатуре, 
				ВариантНакопления);
		КонецЕсли;
		
	КонецЕсли;
// --Общий модуль СкидкиНаценкиСкиентСервер.АвтоНаименованиеУсловияПредоставленияСкидки

Объект.Наименование = СтрокаНаименования;
