Параметры.Вставить("ЗагруженыНастройки");

Отказ = Истина;
ПереченьКонстант = Новый Массив;
ПереченьЗеркальныхКонстант = Новый Массив;

ПереченьКонстант.Добавить("ВалютаРегламентированногоУчета");
ПереченьКонстант.Добавить("ВалютаУправленческогоУчета");
ПереченьКонстант.Добавить("ЗаголовокСистемы");
ПереченьКонстант.Добавить("ИспользоватьОплатуПлатежнымиКартами");
ПереченьКонстант.Добавить("ДополнительнаяКолонкаПечатныхФормДокументов");
ПереченьКонстант.Добавить("ИспользоватьХарактеристикиНоменклатуры");
ПереченьКонстант.Добавить("ЕдиницаИзмеренияВеса");
ПереченьКонстант.Добавить("ЕдиницаИзмеренияОбъема");
ПереченьКонстант.Добавить("ПрефиксУзлаРаспределеннойИнформационнойБазы");
ПереченьКонстант.Добавить("ИспользоватьЗаказыКлиентов");
ПереченьКонстант.Добавить("ИспользоватьЗаказыПоставщикам");
ПереченьКонстант.Добавить("ИспользоватьПодключаемоеОборудование");
ПереченьКонстант.Добавить("ИспользоватьКомиссиюПриПродажах");
ПереченьКонстант.Добавить("ИспользоватьКомиссиюПриЗакупках");
ПереченьКонстант.Добавить("ИспользоватьНоменклатуруПоставщиков");
ПереченьКонстант.Добавить("ИспользоватьДополнительныеРеквизитыИСведения");
ПереченьКонстант.Добавить("ИспользоватьСерииНоменклатуры");
ПереченьКонстант.Добавить("ИспользоватьУпаковкиНоменклатуры");
ПереченьКонстант.Добавить("ИспользоватьРозничныеПродажи");
ПереченьКонстант.Добавить("ИспользоватьСоглашенияСКлиентами");
ПереченьКонстант.Добавить("ИспользоватьИндивидуальныеСоглашенияСКлиентами");
ПереченьКонстант.Добавить("ИспользоватьТиповыеИИндивидуальныеСоглашенияСКлиентами");
ПереченьКонстант.Добавить("ИспользоватьТиповыеСоглашенияСКлиентами");
ПереченьКонстант.Добавить("ИспользованиеСоглашенийСКлиентами");
ПереченьКонстант.Добавить("ИспользоватьНесколькоВидовНоменклатуры");
ПереченьКонстант.Добавить("ИспользоватьДоверенностиНаПолучениеТМЦ");
ПереченьКонстант.Добавить("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
ПереченьКонстант.Добавить("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
ПереченьКонстант.Добавить("ИспользоватьДоговорыСКлиентами");
ПереченьКонстант.Добавить("ИспользоватьКомиссиюПриПродажахБазовая");
ПереченьКонстант.Добавить("ИспользоватьКомиссиюПриЗакупкахБазовая");
ПереченьКонстант.Добавить("ИспользоватьКомиссиюПриПродажахНеБазовая");
ПереченьКонстант.Добавить("ИспользоватьКомиссиюПриЗакупкахНеБазовая");
ПереченьКонстант.Добавить("ИспользоватьДоговорыСПоставщиками");
ПереченьКонстант.Добавить("ИспользоватьПричиныОтменыЗаказовКлиентов");
ПереченьКонстант.Добавить("ИспользоватьПричиныОтменыЗаказовПоставщикам");
ПереченьКонстант.Добавить("ИспользоватьКорректировкиПриобретений");
ПереченьКонстант.Добавить("ИспользоватьКорректировкиРеализаций");
ПереченьКонстант.Добавить("ВестиСведенияДляДекларацийАлкоВРознице");
ПереченьКонстант.Добавить("ИспользоватьПочтовыйКлиент");

Если Не Параметры.ЭтоБазоваяВерсия Тогда
	
	ПереченьКонстант.Добавить("ОграничиватьДоступНаУровнеЗаписей");
	ПереченьКонстант.Добавить("ИспользоватьЦеновыеГруппы");
	ПереченьКонстант.Добавить("ИспользоватьКачествоТоваров");
	ПереченьКонстант.Добавить("ИспользоватьСкладыВТабличнойЧастиДокументовЗакупки");
	ПереченьКонстант.Добавить("ИспользоватьСкладыВТабличнойЧастиДокументовПродажи");
	ПереченьКонстант.Добавить("ИспользоватьАвтоматическиеСкидкиВПродажах");
	ПереченьКонстант.Добавить("ИспользоватьКартыЛояльности");
	ПереченьКонстант.Добавить("ИспользоватьРаздельныйУчетПоНалогообложению");
	ПереченьКонстант.Добавить("ИспользоватьМногооборотнуюТару");
	ПереченьКонстант.Добавить("ИспользоватьОрдерныеСклады");
	ПереченьКонстант.Добавить("ИспользоватьПодразделения");
	ПереченьКонстант.Добавить("ИспользоватьНаборы");	
	ПереченьКонстант.Добавить("НеЗакрыватьЗаказыКлиентовБезПолнойОплаты");
	ПереченьКонстант.Добавить("НеЗакрыватьЗаказыКлиентовБезПолнойОтгрузки");
	ПереченьКонстант.Добавить("НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления");
	ПереченьКонстант.Добавить("НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты");
	ПереченьКонстант.Добавить("ИспользоватьИмпортныеТовары");
	ПереченьКонстант.Добавить("ИспользоватьПартнеровКакКонтрагентов");
	ПереченьКонстант.Добавить("ИспользоватьПартнеровИКонтрагентов");

КонецЕсли;

Для Каждого Константа Из ПереченьКонстант Цикл
	
	КонстантаМенеджерЗначения = Константы[Константа].СоздатьМенеджерЗначения();
	КонстантаМенеджерЗначения.Значение = Объект[Константа];
	ЗаписатьОбъектВИБ(КонстантаМенеджерЗначения, ТипЗнч(КонстантаМенеджерЗначения));
	
КонецЦикла;

Для Каждого Константа Из ПереченьЗеркальныхКонстант Цикл
	
	КонстантаМенеджерЗначения = Константы["Не" + Константа].СоздатьМенеджерЗначения();
	КонстантаМенеджерЗначения.Значение = Не Объект[Константа];
	ЗаписатьОбъектВИБ(КонстантаМенеджерЗначения, ТипЗнч(КонстантаМенеджерЗначения));
	
КонецЦикла;
