Параметры.Вставить("ИспользоватьУпаковкиНоменклатуры");
Параметры.Вставить("ИспользоватьХарактеристикиНоменклатуры");
//Параметры.Вставить("ИспользоватьОрдерныеСклады");
//Параметры.Вставить("ВыгруженыОрганизации");
Параметры.Вставить("КешВидовНоменклатуры");
//Параметры.Вставить("ТабНоменклатурыТары");
//Параметры.Вставить("ТабАлкогольнаяПродукцияНоменклатуры");

//Запрос = Новый Запрос("
//|ВЫБРАТЬ ПЕРВЫЕ 1
//|	1
//|ИЗ
//|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
//|ГДЕ
//|	ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура.).ЕдиницаХраненияОстатков <> ЕдиницыИзмерения.Ссылка
//|");

//Параметры.ИспользоватьУпаковкиНоменклатуры = Не Запрос.Выполнить().Пустой();
//Параметры.ВыгруженыОрганизации = Ложь;
Параметры.ИспользоватьХарактеристикиНоменклатуры = Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
Параметры.КешВидовНоменклатуры = Новый Соответствие;

//// Определим перечень номенклатуры-тары
//Запрос = Новый Запрос(
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	АвансовыйОтчетВозвратнаяТара.Номенклатура КАК Номенклатура
//	|ПОМЕСТИТЬ НоменклатураТара
//	|ИЗ
//	|	Документ.АвансовыйОтчет.ВозвратнаяТара КАК АвансовыйОтчетВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВнутреннийЗаказВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ВнутреннийЗаказ.ВозвратнаяТара КАК ВнутреннийЗаказВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВозвратТоваровОтПокупателяВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ВозвратТоваровОтПокупателя.ВозвратнаяТара КАК ВозвратТоваровОтПокупателяВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВозвратТоваровПоставщикуВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ВозвратТоваровПоставщику.ВозвратнаяТара КАК ВозвратТоваровПоставщикуВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВозвратТоваровПоставщикуИзНТТВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ВозвратТоваровПоставщикуИзНТТ.ВозвратнаяТара КАК ВозвратТоваровПоставщикуИзНТТВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ЗаказПокупателяВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ЗаказПокупателя.ВозвратнаяТара КАК ЗаказПокупателяВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ЗаказПоставщикуВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ЗаказПоставщику.ВозвратнаяТара КАК ЗаказПоставщикуВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ИзменениеЛимитовВозвратнойТарыВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ИзменениеЛимитовВозвратнойТары.ВозвратнаяТара КАК ИзменениеЛимитовВозвратнойТарыВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	КорректировкаВнутреннегоЗаказаВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.КорректировкаВнутреннегоЗаказа.ВозвратнаяТара КАК КорректировкаВнутреннегоЗаказаВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	КорректировкаДолгаПоВозвратнойТареВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.КорректировкаДолгаПоВозвратнойТаре.ВозвратнаяТара КАК КорректировкаДолгаПоВозвратнойТареВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	КорректировкаЗаказаПокупателяВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.КорректировкаЗаказаПокупателя.ВозвратнаяТара КАК КорректировкаЗаказаПокупателяВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	КорректировкаЗаказаПоставщикуВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.КорректировкаЗаказаПоставщику.ВозвратнаяТара КАК КорректировкаЗаказаПоставщикуВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ПеремещениеТоваровВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК ПеремещениеТоваровВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ПоступлениеТоваровУслугВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслуг.ВозвратнаяТара КАК ПоступлениеТоваровУслугВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ПоступлениеТоваровУслугВНТТВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслугВНТТ.ВозвратнаяТара КАК ПоступлениеТоваровУслугВНТТВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ПриходныйОрдерНаТоварыВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.ПриходныйОрдерНаТовары.ВозвратнаяТара КАК ПриходныйОрдерНаТоварыВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	РазмещениеЗаказаВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.РазмещениеЗаказа.ВозвратнаяТара КАК РазмещениеЗаказаВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	РасходныйОрдерНаТоварыВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.РасходныйОрдерНаТовары.ВозвратнаяТара КАК РасходныйОрдерНаТоварыВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	РеализацияТоваровУслугВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК РеализацияТоваровУслугВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	РезервированиеТоваровВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.РезервированиеТоваров.ВозвратнаяТара КАК РезервированиеТоваровВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СписаниеТоваровВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.СписаниеТоваров.ВозвратнаяТара КАК СписаниеТоваровВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СчетНаОплатуПокупателюВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.СчетНаОплатуПокупателю.ВозвратнаяТара КАК СчетНаОплатуПокупателюВозвратнаяТара
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СчетНаОплатуПоставщикаВозвратнаяТара.Номенклатура
//	|ИЗ
//	|	Документ.СчетНаОплатуПоставщика.ВозвратнаяТара КАК СчетНаОплатуПоставщикаВозвратнаяТара
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	НоменклатураТара.Номенклатура
//	|ИЗ
//	|	НоменклатураТара КАК НоменклатураТара");

//ТабНоменклатурыТары = Запрос.Выполнить().Выгрузить();
//ТабНоменклатурыТары.Индексы.Добавить("Номенклатура");

//Параметры.ТабНоменклатурыТары = ТабНоменклатурыТары;

//// Определим, используются ли ордерные склады

//Запрос = Новый Запрос("
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Док.Ссылка
//	|ИЗ
//	|	Документ.ПриходныйОрдерНаТовары КАК Док
//	|ГДЕ
//	|	Док.Проведен = ИСТИНА
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Док.Ссылка
//	|ИЗ
//	|	Документ.РасходныйОрдерНаТовары КАК Док
//	|ГДЕ
//	|	Док.Проведен = ИСТИНА
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Док.Ссылка
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслуг КАК Док
//	|ГДЕ
//	|	Док.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.ПоОрдеру)
//	|	И Док.Проведен = ИСТИНА
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Док.Ссылка
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг КАК Док
//	|ГДЕ
//	|	Док.ВидПередачи = ЗНАЧЕНИЕ(Перечисление.ВидыПередачиТоваров.ПоОрдеру)
//	|	И Док.Проведен = ИСТИНА
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Док.Ссылка
//	|ИЗ
//	|	Документ.ВозвратТоваровПоставщику КАК Док
//	|ГДЕ
//	|	Док.ВидПередачи = ЗНАЧЕНИЕ(Перечисление.ВидыПередачиТоваров.ПоОрдеру)
//	|	И Док.Проведен = ИСТИНА
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Док.Ссылка
//	|ИЗ
//	|	Документ.ВозвратТоваровОтПокупателя КАК Док
//	|ГДЕ
//	|	Док.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.ПоОрдеру)
//	|	И Док.Проведен = ИСТИНА");
//Параметры.ИспользоватьОрдерныеСклады = Не Запрос.Выполнить().Пустой();

//Параметры.ТабАлкогольнаяПродукцияНоменклатуры = Новый ТаблицаЗначений;
//Параметры.ТабАлкогольнаяПродукцияНоменклатуры.Колонки.Добавить("Номенклатура");
//Параметры.ТабАлкогольнаяПродукцияНоменклатуры.Колонки.Добавить("АлкогольнаяПродукция");
//Параметры.ТабАлкогольнаяПродукцияНоменклатуры.Колонки.Добавить("ВидАлкогольнойПродукции");
//Параметры.ТабАлкогольнаяПродукцияНоменклатуры.Колонки.Добавить("ВестиУчетПоГТД");

//Если Не ЗначениеЗаполнено(Параметры.Организации) Тогда
//	Параметры.Организации = Новый Массив;
//ИначеЕсли ТипЗнч(Параметры.Организации) = Тип("СправочникСсылка.Организации") Тогда // когда в обработке универсального обмена задан параметр
//	Организация = Параметры.Организации;
//	Параметры.Организации = Новый Массив;
//	Параметры.Организации.Добавить(Организация);
//КонецЕсли;

//Если Не ЗначениеЗаполнено(Параметры.ДатаОстатков) Тогда
//	Параметры.ДатаОстатков = НачалоГода(ТекущаяДата());
//КонецЕсли;

//Параметры.Вставить("ВалютаРеглУчета", глЗначениеПеременной("ВалютаРегламентированногоУчета"));
//Параметры.Вставить("ВалютаУпрУчета", глЗначениеПеременной("ВалютаУправленческогоУчета"));
//Параметры.Вставить("КурсВУУ", МодульВалютногоУчета.ПолучитьКурсВалюты(Параметры.ВалютаУпрУчета,Параметры.ДатаОстатков));
