Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	УчетнаяПолитикаНалоговыйУчет.Период,
	|	истина как Активность,
	|	УчетнаяПолитикаНалоговыйУчет.Организация,
	|	УчетнаяПолитикаНалоговыйУчет.МоментОпределенияНалоговойБазыНДС,
	|	УчетнаяПолитикаНалоговыйУчет.ОрганизацияЯвляетсяПлательщикомЕНВД,
	|	УчетнаяПолитикаНалоговыйУчет.РозничнаяТорговляОблагаетсяЕНВД,
	|	УчетнаяПолитикаНалоговыйУчет.СложныйУчетНДС,
	|	УчетнаяПолитикаНалоговыйУчет.НДСРежимУчетаРаспределенныхОплат,
	|	УчетнаяПолитикаНалоговыйУчет.НДСИспользованиеОплатПокупателя_Приоритет0,
	|	УчетнаяПолитикаНалоговыйУчет.НДСНалоговыйПериод,
	|	УчетнаяПолитикаНалоговыйУчет.ПартионныйУчетНДСвРазрезеСерийИХарактеристик,
	|	УчетнаяПолитикаНалоговыйУчет.ПартионныйУчетНДСвРазрезеСкладов,
	|	УчетнаяПолитикаНалоговыйУчет.НДСПриНеподтвержденииСверху,
	|	УчетнаяПолитикаНалоговыйУчет.ОрганизацияНеЯвляетсяПлательщикомНДС,
	|	УчетнаяПолитикаНалоговыйУчет.ПорядокРегистрацииСчетовФактурНаАванс
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет");

Выгрузка = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из Выгрузка Цикл
	ВыгрузитьПоПравилу(Строка,,,, "УчетнаяПолитикаОрганизаций");
КонецЦикла;
