ВалютаРеглУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
ВалютаПоДоговору = Источник.ДоговорКонтрагента.ВалютаВзаиморасчетов;
Если Источник.ВалютаДокумента = ВалютаРеглУчета Тогда
	Если ВалютаПоДоговору = ВалютаРеглУчета Тогда
		Значение = "РасчетыВРубляхОплатаВРублях";
	Иначе
		Значение = "РасчетыВВалютеОплатаВРублях";
	КонецЕсли;
Иначе
	Если ВалютаПоДоговору = ВалютаРеглУчета Тогда
		Значение = "РасчетыВРубляхОплатаВВалюте";
	Иначе
		Значение = "РасчетыВВалютеОплатаВВалюте";
	КонецЕсли;
КонецЕсли;
