//Запрос = Новый Запрос("
//	|ВЫБРАТЬ
//	|	ВводОстатков.Ссылка,
//	|	ВводОстатков.Дата КАК Дата,
//	|	ВводОстатков.Организация,
//	|	ВводОстатков.Контрагент,
//	|	ВводОстатков.НомерСчетаФактуры КАК НомерСчетФактуры,
//	|	ВводОстатков.ДатаСчетаФактуры КАК ДатаСчетФактуры,
//	|	ВалютаУправленческогоУчета.Значение КАК Валюта
//	|ИЗ
//	|	Документ.ВводОстатков КАК ВводОстатков,
//	|	Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
//	|ГДЕ
//	|	ВводОстатков.Проведен = ИСТИНА
//	|	И ВводОстатков.ПредъявленСчетФактура = ИСТИНА");
	
//Выборка = Запрос.Выполнить().Выбрать();

ВалютаСФ = Константы.ВалютаУправленческогоУчета.Получить();
Для Каждого Элемент Из Параметры.ВводОстатковСчетаФактуры Цикл
	
	ДанныеСчетаФактуры = ЗакупкиСервер.ДанныеСчетаФактурыСтруктурой(
		Элемент.Объект.Ссылка,
		Элемент.Объект.Организация,
		Элемент.Объект.Контрагент,
		Элемент.НомерСчетФактуры,
		Элемент.ДатаСчетФактуры,
		ВалютаСФ,
		Элемент.Объект.Дата);
		
	ЗакупкиСервер.ВвестиСчетФактуру(ДанныеСчетаФактуры, Истина, Ложь);
	
КонецЦикла;
